In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one -0.122346 -0.178559
1    a  two -0.860454  0.373380
2    b  one -1.239723 -1.823669
3    b  two -0.202033  1.053267
4    a  one  1.008508  0.103416

In [5]:
#SeriesGroupBy
df['data1'].groupby(by=df['key1']).sum()

key1
a    0.025708
b   -1.441756
Name: data1, dtype: float64

In [9]:
df['data1'].groupby([df['key1'],df['key2']]).mean().unstack()

key2       one       two
key1
a     0.443081 -0.860454
b    -1.239723 -0.202033

In [14]:
#DataFrameGroupby
df.groupby(by=['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.443081 -0.037571
     two  -0.860454  0.373380
b    one  -1.239723 -1.823669
     two  -0.202033  1.053267

In [17]:
##SeriesGroupBy
df.groupby(by=['key1','key2'])['data1'].mean()

key1  key2
a     one     0.443081
      two    -0.860454
b     one    -1.239723
      two    -0.202033
Name: data1, dtype: float64